# Taps
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-drivers"
tap "homebrew/cask-versions"
tap "homebrew/bundle"
tap "stripe/stripe-cli"

# Binaries
brew "zsh"       # install latest Zsh
brew "bash"      # install latest Bash
brew "coreutils" # install core utilites since those that come with macOS are outdated
brew "moreutils" # install other utilites like `sponge` etc.
brew "findutils" # install GNU `find`, `locate`, `updatedb`, and `xargs`, `g`-prefixed
brew "gnu-sed"   # install GNU `sed`, overwriting the built-in `sed`

brew "autoconf"
brew "ack"
brew "asciinema"
brew "autojump"
brew "blueutil"
brew "croc"
brew "dark-mode"
brew "diff-so-fancy"
brew "direnv"
brew "entr"
brew "fd"
brew "ffmpeg"
brew "fzf"
brew "git"
brew "git-lfs"
brew "git-flow"
brew "git-extras"
brew "gnupg"
brew "grep"
brew "httpie"
brew "htop"
brew "jo"
brew "jq"
brew "libxml2"
brew "libxslt"
brew "lua"
brew "lynx"
brew "nmap"
brew "openssh"
brew "p7zip"
brew "pandoc"
brew "pigz"
brew "pkg-config"
brew "pstree"
brew "pv"
brew "readline"
brew "reattach-to-user-namespace"
brew "rename"
brew "ripgrep"
brew "speedtest_cli"
brew "ssh-copy-id"
brew "stow"
brew "svn"
brew "switchaudio-osx"
brew "the_silver_searcher"
brew "tldr"
brew "tree"
brew "webkit2png"
brew "wget"
brew "youtube-dl"
brew "zopfli"
brew "zoxide"

# Development
brew "asdf" # language version manager
brew "imagemagick"
brew "neovim"
brew "nginx"
brew "node"
brew "phantomjs"
brew "posgresql"
brew "redis"
brew "screen"
brew "tmux"
brew "vim"
brew "webpack"
brew "yarn"

# 3rd Party CLI Tools
brew "arduino-cli"
brew "awscli"
brew "gh"
brew "hub"
brew "stripe/stripe-cli/stripe"
brew "stripe/stripe-mock/stripe-mock"

# Mac
brew "mackup" # Mac backup configs
brew "mas"    # Mac App Store manager

# Quicklook
brew "qlcolorcode"
brew "qlstephen"
brew "qlmarkdown"
brew "quicklook-json"
brew "qlimagesize"
brew "suspicious-package"
brew "apparency"
brew "quicklookase"
brew "qlvideo"

# CTF tools
# see https://github.com/ctfs/write-ups
brew "aircrack-ng"
brew "bfg"
brew "binutils"
brew "binwalk"
brew "cifer"
brew "dex2jar"
brew "dns2tcp"
brew "fcrackzip"
brew "foremost"
brew "hashpump"
brew "hydra"
brew "john"
brew "knock"
brew "netpbm"
brew "nmap"
brew "pngcheck"
brew "socat"
brew "sqlmap"
brew "tcpflow"
brew "tcpreplay"
brew "tcptrace"
brew "ucspi-tcp" # `tcpserver` etc.
brew "homebrew/x11/xpdf"
brew "xz"

# Apps

## hci ergonomics
cask "quicksilver"
cask "hammerspoon"
cask "karabiner-elements"
cask "contexts"
cask "bettertouchtool"
cask "keyboard-maestro"
cask "alfred"
cask "raycast"
# totalspaces3

## security
cask "authy"
cask "1password"
cask "nordvpn"
# backblaze

## productivity
cask "fantastical"
cask "cardhop"
cask "spark"
cask "agenda"
# microsoft office suite 

## browsers
cask "firefox"
cask "google-chrome"

## notetaking
cask "nvalt"
cask "obsidian"
cask "taskpaper"
cask "textexpander"
cask "zotero"
cask "calibre"
cask "ankicask"

## communication
cask "discord"
cask "slack"
cask "skype"
cask "zoom"
cask "adium"

## sync
cask "dropbox"
cask "box-sync"
cask "screens"
cask "screens-connect"
cask "luna-display"

## dev
cask "iterm2"
cask "fig"
cask "atom"
cask "arduino"
cask "processing"
cask "sublime-text"
cask "visual-studio-code"
cask "postgres-unofficial"
cask "postico"
cask "tableplus"
cask "gitkraken"
cask "dash"
cask "sloth"
cask "ngrok"
cask "tunnelbear"
cask "cyberduck"
cask "raspberry-pi-imager"
cask "android-file-transfer"
cask "xquartz"
# arduino pro

## design
cask "rhino"
cask "figma"
cask "framer"
cask "inkscape"
cask "protopie"
cask "principle"
cask "prusaslicer"
cask "ultimaker-cura"
cask "autodesk-fusion360"
cask "adobe-creative-cloud"

## media
cask "vlc"
cask "vox"
cask "obs"
cask "iina"
cask "airfoil"
cask "audacity"
cask "handbrake"
cask "soundsource"
cask "transmission"
cask "audio-hijack"
cask "sound-control"
cask "elmedia-player"
cask "4k-video-downloader"
# daftcloud

## utilites
cask "bartender"
cask "caffeine"
cask "flux"
cask "beardedspice"
cask "shortcat"
cask "geektool"
cask "keycastr"
cask "key-codes"
cask "cheatsheet"
cask "customshortcuts"
cask "cocktail"
cask "lingon-x"
cask "appcleaner"
cask "the-unarchiver"
cask "image2icon"
cask "fman"
cask "keka"
# logi options

# Fonts
cask "font-lato"
cask "font-open-sans"
cask "font-roboto"
cask "font-powerline-symbols"
cask "font-sf-mono-for-powerline"
cask "font-source-code-pro-for-powerline"
cask "font-source-code-pro"
cask "font-source-sans-pro"
cask "font-source-serif-pro"

# Mac App Store
mas "XCode", id: 497799835
mas "Sorted", id: 1306893526	
mas "Bumpr", id: 1166066070
## utilities
mas "LightBlue", id: 557428110
mas "BlueSee BLE Debugger", id: 1336679524
mas "Image2icon", id: 992115977
## menubar apps
mas "RunCat", id: 1429033973
mas "EasyRes", id: 688211836
mas "FruitJuice", id: 671736912
mas "Battery Monitor", id: 836505650
## safari extensions
mas "Vimari", id: 1480933944
mas "uBlock", id: 1385985095
mas "Userscripts", id: 1463298887
mas "Smart Keyword Search", id: 1541221580
mas "Dark Reader for Safari", id: 1438243180
mas "DuckDuckGo Privacy Essentials", id: 1482920575
